#ifndef SCIENCE_MATH_INTERPOL_EXCEPTION_H_INCLUDED_
#define SCIENCE_MATH_INTERPOL_EXCEPTION_H_INCLUDED_
/*
==============================
E X C E P T I O N . c
============================== 
*/
#include "extra_type.h"
/*!*****************************************************************************
	@brief Завершает работу программы при ее вызове с указанием ошибки с аргументами как wprintf.
	@param errstr - текст ошибки, ... - аргумент(ы) ошибки.
	@date 2024/03/05
*******************************************************************************/
void die(const wchar* errstr, ...);
/*!*****************************************************************************
	@brief Печатает текст в формате ошибки и ее аргументамы. Как wprintf.
	@param errstr - текст ошибки, ... - аргумент(ы) ошибки.
	@date 2024/03/05
*******************************************************************************/
void print_error(const wchar* errstr, ...);
#endif